app/views/games/show.html.erb

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 980190962]]
---
  <div class="flex flex-col gap-3">
    <% @question.answers.each do |answer| %>